In [33]:
import pandas as pd

In [49]:
df = pd.DataFrame(
    {'nombres':['Juan', 'Ronald', 'Carla', 'Nuria', 'Jose', 'Deni', None],
    'edades':[35, 36, 28, 19, 25, 'No te lo digo', None],
    'dinero':[1000, 5000, 500, 1000000, 'no quiero', 'casi un millón', None],
    'soy Nuria':[False, False, False, True, False, False, None],
    'id': [1, 2, 3, 4, 5, 6, 7]}
    )
df

  nombres         edades          dinero soy Nuria  id
0    Juan             35            1000     False   1
1  Ronald             36            5000     False   2
2   Carla             28             500     False   3
3   Nuria             19         1000000      True   4
4    Jose             25       no quiero     False   5
5    Deni  No te lo digo  casi un millón     False   6
6    None           None            None      None   7

# Analizar datos

In [35]:
df.size

35

In [36]:
df.shape

(7, 5)

In [37]:
df.columns

Index(['nombres', 'edades', 'diner', 'soy Nuria', 'id'], dtype='object')

In [38]:
df.info() # Tipo de dato

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   diner      6 non-null      object
 3   soy Nuria  6 non-null      object
 4   id         7 non-null      int64
dtypes: int64(1), object(4)
memory usage: 408.0+ bytes

In [39]:
df.describe() # Devuelve solo los numericos

             id
count  7.000000
mean   4.000000
std    2.160247
min    1.000000
25%    2.500000
50%    4.000000
75%    5.500000
max    7.000000

In [40]:
df.describe(include = 'object') # Devuelve solo los tipo object

       nombres  edades  diner soy Nuria
count        6       6      6         6
unique       6       6      6         2
top       Juan      35   1000     False
freq         1       1      1         5

In [41]:
df.describe(include = 'all') # Devuelve la media de los dos (object y numerico) pero no es muy visual

       nombres  edades   diner soy Nuria        id
count        6     6.0     6.0         6  7.000000
unique       6     6.0     6.0         2       NaN
top       Juan    35.0  1000.0     False       NaN
freq         1     1.0     1.0         5       NaN
mean       NaN     NaN     NaN       NaN  4.000000
std        NaN     NaN     NaN       NaN  2.160247
min        NaN     NaN     NaN       NaN  1.000000
25%        NaN     NaN     NaN       NaN  2.500000
50%        NaN     NaN     NaN       NaN  4.000000
75%        NaN     NaN     NaN       NaN  5.500000
max        NaN     NaN     NaN       NaN  7.000000

In [42]:
df['id'] = df['id'].astype('string')

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   diner      6 non-null      object
 3   soy Nuria  6 non-null      object
 4   id         7 non-null      string
dtypes: object(4), string(1)
memory usage: 408.0+ bytes

In [44]:
df['edades'] = df['edades']

In [45]:
# astype sirva para transformal los tipos de datos de las columnas
#df['soy Nuria'] = df['soy Nuria'].astype('bool')

In [46]:
#df['soy Nuria'] = df['soy Nuria'].astype('Int32') # Int con mayúscula

In [47]:
df

  nombres         edades           diner soy Nuria id
0    Juan             35            1000     False  1
1  Ronald             36            5000     False  2
2   Carla             28             500     False  3
3   Nuria             19         1000000      True  4
4    Jose             25       no quiero     False  5
5    Deni  No te lo digo  casi un millón     False  6
6    None           None            None      None  7

## Solventar y cambiar el tipo de dato

#### Haciendo una función

In [55]:
def solventar_dinero(x):
    if isinstance(x, (str, int)) or x == None:
        return pd.NA
    return x

In [57]:
solventar_dinero(None)

In [59]:
df['dinero'] = df['dinero'].apply(solventar_dinero)
df

  nombres         edades     dinero soy Nuria  id
0    Juan             35     1000.0     False   1
1  Ronald             36     5000.0     False   2
2   Carla             28      500.0     False   3
3   Nuria             19  1000000.0      True   4
4    Jose             25        NaN     False   5
5    Deni  No te lo digo   999999.0     False   6
6    None           None        NaN      None   7

### Añadiendo directamente un lambda

In [51]:
df['dinero'] = df['dinero'].apply(lambda x: 999_999 if x == 'casi un millón' else(np.nan if x == 'no quiero' else x))
df

  nombres         edades     dinero soy Nuria  id
0    Juan             35     1000.0     False   1
1  Ronald             36     5000.0     False   2
2   Carla             28      500.0     False   3
3   Nuria             19  1000000.0      True   4
4    Jose             25        NaN     False   5
5    Deni  No te lo digo   999999.0     False   6
6    None           None        NaN      None   7

In [61]:
import numpy as np
df.loc[4, "dinero"] = np.nan

In [62]:
df.loc[5, "dinero"] = 999_999

In [63]:
df

  nombres         edades     dinero soy Nuria  id
0    Juan             35     1000.0     False   1
1  Ronald             36     5000.0     False   2
2   Carla             28      500.0     False   3
3   Nuria             19  1000000.0      True   4
4    Jose             25        NaN     False   5
5    Deni  No te lo digo   999999.0     False   6
6    None           None        NaN      None   7

In [65]:
df['edades'].replace('No te lo digo', np.nan, inplace = True) # El replace lo van a quitar pronto

C:\Users\nuria\AppData\Local\Temp\ipykernel_30476\425580707.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['edades'].replace('No te lo digo', np.nan, inplace = True) # El replace lo van a quitar pronto

In [66]:
df

  nombres  edades     dinero soy Nuria  id
0    Juan    35.0     1000.0     False   1
1  Ronald    36.0     5000.0     False   2
2   Carla    28.0      500.0     False   3
3   Nuria    19.0  1000000.0      True   4
4    Jose    25.0        NaN     False   5
5    Deni     NaN   999999.0     False   6
6    None     NaN        NaN      None   7

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     5 non-null      float64
 2   dinero     5 non-null      float64
 3   soy Nuria  6 non-null      object
 4   id         7 non-null      int64
dtypes: float64(2), int64(1), object(2)
memory usage: 408.0+ bytes

In [ ]:
# Al haber muchos nulos, los datos carecen de sentido por eso hay que saber que cantidad de nulos hay
(df.isnull().sum()/len(df))*100 # Porcentaje de nulos por columna

nombres      14.285714
edades       28.571429
dinero       28.571429
soy Nuria    14.285714
id            0.000000
dtype: float64

## Cardinalidad
##### El numero que hay de cada elemento

In [71]:
# Total de elementos /entre/ los elementos únicos
(len(df['edades'].unique())/len(df)*100)

85.71428571428571

In [72]:
for i in df:
    print(i)
    print(len(df['edades'].unique())/len(df)*100)

nombres
85.71428571428571
edades
85.71428571428571
dinero
85.71428571428571
soy Nuria
85.71428571428571
id
85.71428571428571